packages/storyline-nav/src/StorylineNav.php

    public function getNavHTMLFromCourseNORECURSION(Course $course) {

//        //Get Current Course->Storyline->Items
//        $data = storyline_core()->getIndex($course);
////        dd($data);
//        $html_obj = new RenderHTML();
//        $html_menu = $html_obj->buildhtmlMENU($data, true, $page, false, $course);
////        dd($html_menu);
//        return $html_menu;

        $storyline = $course->latest_storyline()->items->first();
        $node = StorylineItem::where('id', '=', $storyline->id)->first();
---
select * from `storyline_items` where `id` = '616' limit 1