packages/laravel-lti/src/Http/Controllers/LTIBaseController.php

select * from `users_lti_links` where `lti_user_id` = '998928898' limit 1
---
    public function __construct() {
        if($this->hasLTI) {
            $this->middleware(function ($request, $next) {

                $launch = LTIX::laravelSetup($request, LTIX::ALL);

                if(array_key_exists('user_id', $request->all()) && !UserLTILink::where('lti_user_id', $request->all()['user_id'])->first()) {

select * from `users_lti_links` where `lti_user_id` = '998928898' limit 1
---
//                        }
//                    }
                } else if(array_key_exists('user_id', $request->all())) {
                    $user =  UserLTILink::where('lti_user_id', $request->all()['user_id'])->first();