packages/storyline-menu/src/StorylineMenu.php

    public function getMenuHTMLFromCourse(Course $course, $config = false, $page = false) {
//        $data = storyline_core()->getIndex($course);
//
//        $html_obj = new RenderHTML();
//        $html = $html_obj->build($data, true, $page, false, $course);
//
//        return $html;
//        $storyline = $course->latest_storyline();
//        $node = StorylineItem::where('id', '=', '616')->first();
//        //dd($node);
//        $html_obj = new RenderHTML();
//        $html = $html_obj->renderNode($node);
//        dd($html);
        $storyline = $course->latest_storyline()->items->first();
        $node = StorylineItem::where('id', '=', $storyline->id)->first();
---
select * from `storyline_items` where `id` = '616' limit 1