packages/storyline-breadcrumbs/src/StorylineBreadcrumbs.php

select `parent_id` from `storyline_items` where `id` = '154' limit 1
---
    public function getCategoryTreeIDs($catID) {

        $html = '';
//       $row = DB::getInstance()->query("SELECT parent FROM categories WHERE ID = '$catID'")->fetch();
        //$row = DB::table('storyline_items')->select('parent_id')->where('id', $catID)->first();
        $row = array();
        $row = StorylineItem::where('id', $catID)->select('parent_id')->first()->toArray();

select `id`, `name`, `file_url` from `storyline_items` where `id` = '616' limit 1
---
    public function getNameLink($catID, $data=[], $course) {
        $catID = (int) $catID;
        $d = $data;
        //$check = DB::getInstance()->query("SELECT ID, Name FROM categories WHERE ID = '$catID' LIMIT 1")->fetch();
//        $check = DB::table('storyline_items')->select('id, name')->where('id', $catID)->first();
        $check= StorylineItem::where('id', $catID)->select('id','name', 'file_url')->first()->toArray();