packages/roles-permissions/src/RolesPermissionsServiceProvider.php

select * from `permissions`
---
    public function boot() {
        $this->publishMigrations();
        $this->routes();
        $this->views();
        $this->publishes([
            __DIR__.'/assets' => public_path('vendor/roles'),
        ], 'public');

        /*Permission::get()->map(function ($permission) {
            Gate::define($permission->name, function ($user) use ($permission) {
                return $user->hasPermissionTo($user->last_department_id, $permission) || $user->hasPermissionTo($user->last_department_id, 'Super Admin');
            });
        });*/