packages/roles-permissions/src/Http/Controllers/Admin/Roles/GroupsController.php

    public function index() {
        $groups = Group::get();
---
select * from `groups`