packages/roles-permissions/src/Http/Controllers/Admin/Roles/RolesController.php

    public function index() {
        $roles = Role::with('permissions')->with('users')->get();
---
select * from `roles`
select `permissions`.*, `roles_permissions`.`role_id` as `pivot_role_id`, `roles_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `roles_permissions` on `permissions`.`id` = `roles_permissions`.`permission_id` where `roles_permissions`.`role_id` in ('4', '5', '6')
select `users`.*, `users_roles`.`role_id` as `pivot_role_id`, `users_roles`.`user_id` as `pivot_user_id`, `users_roles`.`group_id` as `pivot_group_id` from `users` inner join `users_roles` on `users`.`id` = `users_roles`.`user_id` where `users_roles`.`role_id` in ('4', '5', '6')