packages/app-store/src/Http/Controllers/AppStoreController.php

    function index() {

        $domains = laravel_lti()->get_domains();

        $breadcrumbs = [
            "title" => "App Store",
        ];

        $categories = AppCategory::all(['title']);
---
select `title` from `lti_app_categories`