app/Http/Controllers/LTI/Courses/CourseLectureItemLTIController.php

    public function index(Course $course, StorylineItem $storylineItem)
    {
        $slCore = new StorylineCore();
        $data = $slCore->getIndex($course);

        $storyline = $course->storylines()->first();
---
select * from `storylines` where `storylines`.`course_id` = '14' and `storylines`.`course_id` is not null limit 1