app/Http/Controllers/Courses/CourseStorylineController.php

select * from `storylines` where `course_id` = '20' limit 1
---
     public function store(Request $request, Course $course) {
        //Check If Course has a Storyline and do an Update else Create a New Storyline
        $nodes = $request->all()['parts'];
        $data = json_decode($nodes, true);
        $stId = Storyline::where('course_id', '=', $course->id)->first();