app/Models/Course.php

select * from `storylines` where `storylines`.`course_id` = '14' and `storylines`.`course_id` is not null order by `created_at` desc limit 1
---
    public function latest_storyline() {
        return $this->hasOne(Storyline::class, 'course_id', 'id')->orderBy('created_at', 'DESC')->first();