packages/laravel-lti/src/Classes/Domains.php

select * from `lti_context` where `lti_context`.`context_id` in ('40', '43', '71', '72', '73', '74', '75', '76')
select * from `lti_domain`
select * from `lti_key` where `lti_key`.`key_id` in ('36', '39', '60', '61', '62', '63', '64', '65')
---
    static public function listDomains() {
        $domains_obj = LTIDomain::with('context')->with('key')->with('category')->get();