packages/Graphs/src/Http/Controllers/TestStencilController.php

select * from `lti_graphs` where `lti_graphs`.`id` = '1' limit 1
---
    public function init(GraphsDomainOBJ $graphsDomainOBJ, $id) {
        // Todo:: Respond based on View
        $graph = $graphsDomainOBJ->__graphs(GraphModel::find($id));